# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeSettingIterator..::..Dispose Method
ConduitSizeSettingIterator Class See Also
---
Releases all resources used by the ConduitSizeSettingIterator
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
ConduitSizeSettingIterator Class
Autodesk.Revit.DB.Electrical Namespace